fonecmid-diplom/src/DataProcessors/ВКМ_МассовоеСозданиеАктов/ВКМ_МассовоеСозданиеАктов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ВКМ_МассовоеСозданиеАктов</name>
  <attributes>
    <name>Период</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Договоры</name>
    <attributes>
      <name>Договор</name>
      <type>
        <types>CatalogRef.ДоговорыКонтрагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>Реализация</name>
      <type>
        <types>DocumentRef.РеализацияТоваровУслуг</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

fonecmid-diplom/src/DataProcessors/ВКМ_МассовоеСозданиеАктов/Forms/ВКМ_Форма/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Объект.Период = НачалоМесяца(ТекущаяДатаСеанса());
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВКМ_ЗаполнитьСписок(Команда)
	
	Если Не ЗначениеЗаполнено(Объект.Период) Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Укажите период (месяц).'"));
		Возврат;
	КонецЕсли;
	
	ВКМ_ЗаполнитьСписокНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ВКМ_СоздатьАкты(Команда)
	
	Если Объект.Договоры.Количество() = 0 Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Сначала заполните список договоров.'"));
		Возврат;
	КонецЕсли;
	
	ДлительнаяОперация = ВКМ_ЗапуститьСозданиеАктовНаСервере();
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ВыводитьПрогрессВыполнения = Истина;
	ПараметрыОжидания.Заголовок = НСтр("ru = 'Создание актов'");
	
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ВКМ_СозданиеАктовЗавершено", ЭтотОбъект);
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ВКМ_ЗаполнитьСписокНаСервере()
	
	ТаблицаДоговоров = Обработки.ВКМ_МассовоеСозданиеАктов.ДоговорыПериода(Объект.Период);
	
	Объект.Договоры.Очистить();
	Для Каждого СтрокаТаблицы Из ТаблицаДоговоров Цикл
		ЗаполнитьЗначенияСвойств(Объект.Договоры.Добавить(), СтрокаТаблицы);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ВКМ_ЗапуститьСозданиеАктовНаСервере()
	
	Договоры = Новый Массив;
	Для Каждого СтрокаДоговора Из Объект.Договоры Цикл
		Если Не ЗначениеЗаполнено(СтрокаДоговора.Реализация) Тогда
			Договоры.Добавить(СтрокаДоговора.Договор);
		КонецЕсли;
	КонецЦикла;
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияФункции(УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru = 'Массовое создание актов'");
	
	Возврат ДлительныеОперации.ВыполнитьФункцию(ПараметрыВыполнения,
		"Обработка.ВКМ_МассовоеСозданиеАктов.МодульОбъекта.СоздатьАкты", Объект.Период, Договоры);
	
КонецФункции

&НаКлиенте
Процедура ВКМ_СозданиеАктовЗавершено(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат.Статус = "Ошибка" Тогда
		ПоказатьПредупреждение(, Результат.КраткоеПредставлениеОшибки);
		Возврат;
	КонецЕсли;
	
	ВКМ_ЗагрузитьРезультатСоздания(Результат.АдресРезультата);
	
КонецПроцедуры

&НаСервере
Процедура ВКМ_ЗагрузитьРезультатСоздания(АдресРезультата)
	
	РезультатСоздания = ПолучитьИзВременногоХранилища(АдресРезультата);
	УдалитьИзВременногоХранилища(АдресРезультата);
	
	Для Каждого СтрокаДоговора Из Объект.Договоры Цикл
		Данные = РезультатСоздания.Получить(СтрокаДоговора.Договор);
		Если Данные = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		Если ЗначениеЗаполнено(Данные.Реализация) Тогда
			СтрокаДоговора.Реализация = Данные.Реализация;
		КонецЕсли;
		Если ЗначениеЗаполнено(Данные.Ошибка) Тогда
			ОбщегоНазначения.СообщитьПользователю(
				СтрШаблон("%1: %2", СтрокаДоговора.Договор, Данные.Ошибка));
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
